Repository: rodrigodelmonte/creators-network-docs
Catalog: source/locales/*/LC_MESSAGES/api.po
Languages: es_es, pt_br

source: OneFootball Network API
pt_br: API da OneFootball Network

source: Introduction
es_es: Introducción
pt_br: Introdução

source: OneFootball is the world's leading digital football platform. The OneFootball Network API allows OneFootball's content partners to publish articles onto the OneFootball platform. It also allows partners to update and delete articles that they have already published to the OneFootball platform.
es_es: OneFootball es la plataforma de fútbol digital líder en el mundo. La API de la OneFootball Network permite a los socios de contenido publicar artículos en la propia plataforma. También permite a los socios actualizar y eliminar artículos que Ya han publicado en la plataforma.
pt_br: OneFootball é a maior plataforma digital de futebol do mundo. A API da OneFootball Network permite que os parceiros de conteúdo do OneFootball publiquem notícias diretamente na plataforma OneFootball. Ela também permite que os parceiros atualizem e excluam artigos que já foram publicados na plataforma OneFootball.

source: The API can be used by partners to set up their own services such that content published on their sites is automatically sent to OneFootball and natively integrated onto the OneFootball platform for OneFootball users.
es_es: Los socios pueden utilizar la API para configurar sus propios servicios de modo que el contenido publicado en sus sitios se envíe automáticamente a OneFootball y se integre de forma nativa en la plataforma OneFootball para los usuarios de OneFootball.
pt_br: A API pode ser usada pelos parceiros para configurar os seus próprios serviços, de modo que o conteúdo publicado nos seus sites seja automaticamente enviado para o OneFootball e, consequentemente, seja lido pelos usuários do OneFootball.

source: Please note that the OneFootball Network is a closed, invite-only platform and only authorized content partners are able to use the OneFootball Network API.
es_es: Por favor tenga en cuenta que la OneFootball Network es una plataforma cerrada, solo para invitados, y solo los socios de contenido autorizados pueden usar la API de la red OneFootball.
pt_br: É importante destacar que a OneFootball Network é uma plataforma fechada, acessível apenas para convidados, e somente parceiros de conteúdo autorizados podem usar a API da OneFootball Network.

source: Conventions
es_es: Convenciones
pt_br: Convenções

source: Before you get started, please note the conventions listed here, which apply throughout the API.
es_es: Antes de empezar, tenga en cuenta las convenciones aquí enumeradas, las cuales se aplican en toda la API.
pt_br: Antes de começar, observe as convenções listadas aqui, que se aplicam a toda a API.

source: Schema
es_es: Esquema
pt_br: Esquema

source: All API access is over HTTPS. All data is sent and received in JSON format.
es_es: Todo el acceso a la API se realiza a través de HTTPS. Todos los datos se envían y reciben en formato JSON.
pt_br: Todo o acesso à API será feito por HTTPS. Todos os dados são enviados e recebidos em formato JSON.

source: Access is from the following URL: https://network-api.onefootball.com
es_es: El acceso es desde la siguiente URL: https://network-api.onefootball.com
pt_br: O acesso pode ser feito através do seguinte URL: https://network-api.onefootball.com

source: Time format
es_es: Formato de tiempo
pt_br: Formato da data

source: All timestamps return in ISO 8601 format ``YYYY-MM-DDTHH:MM:SSZ``.
es_es: Todas las marcas de tiempo están en formato ISO 8601 ``YYYY-MM-DDTHH:MM:SSZ``.
pt_br: Todas a s datas estão no formato ISO 8601 ``YYYY-MM-DDTHH:MM:SSZ``.

source: Authentication
es_es: Autentificación
pt_br: Autenticação

source: Requests that require authentication must provide ``Authorization`` header. The value must be a ``Bearer`` token acquired during the login process.
es_es: Las solicitudes que requieren autenticación deben proporcionar un encabezado ``Authorization``. El valor debe ser un token ``Bearer`` adquirido durante el proceso de inicio de sesión.
pt_br: Requests que exigem autenticação precisam fornecer um cabeçalho ``Authorization``. O valor deve ser um token de verificação ``Bearer`` adquirido durante o processo de login.

source: Examples
es_es: Ejemplos
pt_br: Exemplos

source: In the documentation, we have tried to give code snippet examples that can be copied, pasted and adjusted rather than describing everything in words. Please look to the examples as a reference.
es_es: En la documentación, hemos tratado de dar ejemplos de fragmentos de código que se pueden copiar, pegar y ajustar en lugar de describir todo en palabras. Por favor, mire los ejemplos como referencia.
pt_br: Na documentação, tentamos fornecer exemplos de código que podem ser copiados, colados e ajustados, em vez de descrever tudo em palavras. Por favor, use esses exemplos como referência.

source: Testing
es_es: Prueba
pt_br: Teste

source: When testing the publication and updating of articles, use the optional ``draft`` boolean. A request sent with ``draft`` being ``TRUE`` will ensure that the respective article *will not* be visible to OneFootball users.
es_es: Al probar la publicación y actualización de artículos, utilice el ``draft`` booleano opcional. Una solicitud enviada con ``draft`` como ``TRUE`` garantizará que el artículo respectivo no sea visible para los usuarios de OneFootball.
pt_br: Ao testar a publicação e a atualização de artigos, use o ``draft`` booleano opcional. Um request enviado como ``draft`` a ``TRUE`` garantirá que a respectiva notícia *não* fique visível para os usuários do OneFootball.

source: When you are ready to use your service in production and send real articles to be seen by OneFootball users, you can either leave out the ``draft`` parameter or set ``draft`` to ``FALSE``.
es_es: Cuando esté listo para usar su servicio en producción y enviar artículos reales para que los vean los usuarios de OneFootball, puede omitir el parámetro ``draft`` o establecer ``draft`` como ``FALSE``.
pt_br: Quando você estiver pronto para usar o seu serviço em produção e enviar notícias reais para serem vistas pelos usuários do OneFootball, você pode omitir o parâmetro ``draft`` ou definir o ``draft`` como ``FALSE``.

source: Getting set up
es_es: Cómo configurar
pt_br: Como configurar

source: In order to publish, update or delete content on OneFootball via the OneFootball Network API, you must first do the following:
es_es: Para publicar, actualizar o eliminar contenido en OneFootball a través de la API de la red OneFootball, primero debe hacer lo siguiente:
pt_br: Para publicar, atualizar ou excluir conteúdo do OneFootball através da API, você deve primeiramente fazer o seguinte:

source: Complete the registration for your OneFootball Network account.
es_es: Complete el registro para su cuenta en la OneFootball Network.
pt_br: Registe a sua conta da OneFootball Network.

source: Use your login credentials to retrieve an authentication token that must be used for other requests.
es_es: Use sus credenciales de inicio de sesión para obtener un token de autentificación que debe usarse para otras solicitudes.
pt_br: Use os seus dados de login para obter um token de autenticação que deve ser usado para futuros requests.

source: Retrieve the ID of the integration that you want to publish content under (note that many accounts will have only one website and therefore only one integration).
es_es: Obtenga la ID de la integración en la que desea publicar contenido (tenga en consideración que muchas cuentas tendrán un solo sitio web y, por lo tanto, solo una integración).
pt_br: Obtenha o ID da integração na qual você deseja publicar o conteúdo (observe que muitas contas terão apenas um site e, portanto, apenas uma integração).

source: Activating your OneFootball Network account
es_es: Activación de su cuenta en la OneFootball Network
pt_br: Ativando sua conta da OneFootball Network

source: The OneFootball Network in an invitation-only platform. If you are invited to join and have agreed to come onboard, you will receive a registration email. Please follow the instructions in the registration email, set your password and then proceed to log in to the OneFootball Network portal. Make sure to complete the onboarding process in the portal before trying to publish content via the OneFootball Network API.
es_es: La OneFootball Network en una plataforma solo por invitación. Si está invitado a unirse y ha aceptado unirse, recibirá un correo electrónico de registro. Siga las instrucciones en el correo electrónico de registro, configure su contraseña y luego inicie sesión en el portal de la OneFootball Network. Asegúrese de completar el proceso de incorporación en el portal antes de intentar publicar contenido a través de la API de la OneFootball Network.
pt_br: A OneFootball Network é uma plataforma apenas para convidados. Se você for convidado e concordou em participar, receberá um e-mail de registo. Siga as instruções do e-mail de registo, defina a sua senha e faça o login no portal da OneFootball Network. Lembre-se de concluir o processo de registo no portal antes de tentar publicar conteúdo através da API da OneFootball Network.

source: Retrieving an authentication token
es_es: Obtener el token de autentificación
pt_br: Obter um token de autenticação

source: Once you have successfully logged in to the OneFootball Network portal, you can use the same email address and password credentials to obtain an authentication token for the OneFootball Network API.
es_es: Una vez que haya iniciado sesión con éxito en el portal de la OneFootball Network, puede usar la misma dirección de correo electrónico y contraseña para obtener un token de autenticación para la API de la red OneFootball.
pt_br: Depois de fazer o login no portal da OneFootball Network, você pode usar o mesmo endereço de e-mail e senha para obter um token de autenticação na API da OneFootball Network.

source: You must have a valid authentication token in order to publish, modify, or delete content via requests made to the OneFootball Network API. To acquire a token, send your login credentials as per the example below:
es_es: Debe tener un token de autenticación válido para publicar, modificar o eliminar contenido a través de solicitudes realizadas a la API de la OneFootball Network. Para adquirir un token, envíe sus credenciales de inicio de sesión según el siguiente ejemplo:
pt_br: Você precisa ter um token de autenticação válido para publicar, alterar ou excluir conteúdo através da API da OneFootball Network. Para adquirir um token, envie seus dados de login conforme o exemplo abaixo:

source: Refreshing an authentication token
es_es: Actualizar un token de autentificación
pt_br: Atualizando um token de autenticação

source: Each authentication token is valid for seven days after it is issued. After a token expires, repeat the process by using your login credentials to acquire a new one.
es_es: Cada token de autenticación es válido durante siete días después de su emisión. Después de que caduque un token, repita el proceso utilizando sus credenciales de inicio de sesión para adquirir uno nuevo.
pt_br: Cada token de autenticação é válido por sete dias após a emissão. Quando um token expirar, repita o processo usando os seus dados de login para adquirir um novo token.

source: Listing all registered integrations
es_es: Listado de todas las integraciones registradas
pt_br: Listando todas as integrações registadas

source: In order to publish content, you must specify which of your integrations the content belongs to. In most cases, your account will only have one integration with OneFootball. However accounts with multiple different websites publishing content to OneFootball may have multiple integrations and should therefore select the correct integration for the correct website.
es_es: Para publicar contenido, debe especificar a qué integraciones pertenece el contenido. En la mayoría de los casos, su cuenta solo tendrá una integración con OneFootball. Sin embargo, las cuentas con múltiples sitios web diferentes que publican contenido en OneFootball pueden tener múltiples integraciones y, por lo tanto, hay que seleccionar la integración correcta para el sitio web correcto.
pt_br: Para publicar conteúdo, você deve especificar qual é a integração a que o conteúdo pertence. Na maioria dos casos, a sua conta terá apenas uma integração com o OneFootball. No entanto, contas com vários sites diferentes que publicam conteúdo no OneFootball podem precisar realizar diversas integrações e devem, portanto, selecionar a integração certa para o site certo.

source: You can retrieve a full list of your registered integrations on OneFootball by taking the example below and doing the following:
es_es: Puede obtener una lista completa de sus integraciones registradas en OneFootball tomando el siguiente ejemplo y haciendo lo siguiente:
pt_br: Você pode obter a lista completa das suas integrações seguindo o exemplo abaixo e fazendo o seguinte:

source: Replace ``TOKEN`` in the header with your valid authentication token.
es_es: Reemplace ``TOKEN`` en el encabezado con su token de autentificación válido
pt_br: Substitua ``TOKEN`` no cabeçalho pelo seu token de autenticação válido.

source: Publishing content
es_es: Publicar contenido
pt_br: Publicando conteúdo

source: Once you are set up and have an authentication token, you can publish an article to OneFootball.
es_es: Una vez que haya completado la configuración y tenga un token de autentificación, puede publicar un artículo en OneFootball.
pt_br: Depois de configurar e ter um token de autenticação, você pode publicar um artigo no OneFootball.

source: Publishing an article
es_es: Publicar un artículo
pt_br: Publicando uma artigo

source: Using a valid authentication token, you can publish an article by sending a ``POST`` request to the posts entity endpoint.
es_es: Con un token de autenticación válido, puede publicar un artículo enviando una solicitud ``POST`` al punto final de la entidad de la publicación.
pt_br: Usando um token de autenticação válido, você pode publicar um artigo enviando um request ``POST``.

source: To do so, take the example below and do the following:
es_es: Para hacerlo, use el siguiente ejemplo y haga lo siguiente
pt_br: Para isso, siga o exemplo abaixo e faça o seguinte:

source: Set all article attributes as shown in the example below.
es_es: Establezca todos los atributos del artículo como se muestra en el siguiente ejemplo.
pt_br: Defina todos os atributos do artigo como mostrado no exemplo abaixo.

source: Field
es_es: Campo
pt_br: Campo

source: Usage
es_es: Uso
pt_br: Uso

source: Description
es_es: Descripción
pt_br: Descrição

source: required
es_es: obligatorio
pt_br: obrigatório

source: The ID of the article as defined in your system. It must be unique (within a given language) within your own system.
es_es: El ID del artículo como se define en su sistema. Debe ser único (dentro de un idioma determinado) dentro de su propio sistema.
pt_br: O ID do artigo conforme definido no seu sistema. Ele deve ser único (em um determinado idioma) dentro de seu próprio sistema.

source: The ID of the integration to which the article belongs as defined by Onefootball.
es_es: El ID de la integración a la que pertenece el artículo según lo definido por Onefootball.
pt_br: O ID da integração à que pertence o artigo, conforme definido pelo "OneFootball

source: The link to the article as published on your website. Place your homepage url if the article is not published anywhere else.
es_es: El enlace al artículo publicado en su sitio web. Coloque la URL de su página de inicio si el artículo no se publica en ningún otro lugar.
pt_br: O link para o artigo publicado no seu site. Coloque o URL de sua página inicial se o artigo não estiver publicado em nenhum outro lugar.

source: The language of the article. Valid choices are ``en``, ``de``, ``es``, ``fr``, ``br``, and ``it``.
es_es: El lenguaje del artículo. Las opciones válidas son ``en``, ``de``, ``es``, ``fr``, ``br``, e ``it``.
pt_br: O idioma do artigo. Escolhas válidas são ``en``, ``de``, ``es``, ``fr``, ``br`` e ``it``.

source: The time that the article was published. If in doubt, use the current time.
es_es: La hora en que se publicó el artículo. En caso de duda, utilice la hora actual.
pt_br: A hora em que o artigo foi publicado. Em caso de dúvida, use a hora atual.

source: The time that the article was last updated. If in doubt, use the current time.
es_es: La hora en que se actualizó el artículo por última vez. En caso de duda, utilice la hora actual.
pt_br: A hora em que o artigo foi atualizado pela última vez. Em caso de dúvida, use a hora atual.

source: The content of the article, which must be in correctly-formatted HTML. Please see `this link <https://static.onefootball.com/onefootball-network/technical-documentation/html-guidelines>`_ for important details on acceptable HTML content.
es_es: El contenido del artículo, que debe estar en formato correcto HTML. Por favor vea `este enlace<https://static.onefootball.com/onefootball-network/technical-documentation/html-guidelines>`_ para detalles importantes sobre contenido HTML aceptable.
pt_br: O conteúdo do artigo, que deve estar em HTML corretamente formatado. Consulte `este link <https://static.onefootball.com/onefootball-network/technical-documentation/html-guidelines>`_ para obter detalhes sobre o conteúdo HTML aceitável.

source: The title of the article. The title cannot be an empty string.
es_es: El título del artículo. El título no puede ser una fila vacía.
pt_br: O título do artigo. O título não pode ser uma string vazia.

source: optional
es_es: opcional
pt_br: Opcional

source: An optional field for the URL of the article's featured image. If provided, ``image_width`` and ``image_height`` should be provided as well (the image's width and height in pixels).
es_es: Un campo opcional para la URL de la imagen destacada del artículo. Si se utiliza, se debe proporcionar image_width e image_height de la misma manera (el ancho y el alto de la imagen en píxeles).
pt_br: URL da imagem em destaque na notícia. Se este campos for especificado, ``image_width`` e ``image_height`` também devem ser fornecidos (largura e altura da imagem em pixels).

source: An optional boolean to be used for testing purposes. If set to ``true``, the article will not be made visible to OneFootball users. If not povided, the article will by default be made available to OneFootball users.
es_es: Un booleano opcional para ser utilizado con fines de prueba. Si se establece como true, el artículo no será visible para los usuarios de OneFootball. Si no se proporciona, el artículo estará disponible de forma predeterminada para los usuarios de OneFootball.
pt_br: Um booleano opcional para ser usado em testes. Se configurado como true, o artigo não ficará visível para os usuários do OneFootball. Se não for fornecido, a matéria será predefinida como disponível para os usuários do OneFootball.

source: Updating and deleting content
es_es: Actualizar y eliminar contenido
pt_br: Atualizando e excluindo conteúdo

source: Once your content is on OneFootball, you can manage your content by updating and deleting it.
es_es: Una vez que su contenido esté en OneFootball, puede administrarlo actualizándolo y eliminándolo.
pt_br: Assim que o seu conteúdo for publicado no OneFootball, é possível atualizá-lo e excluí-lo.

source: In order to update or delete an article on OneFootball, you will first need to get the OneFootball post ID for that article.
es_es: Para actualizar o eliminar un artículo en OneFootball, primero deberá obtener la ID de publicación de OneFootball para ese artículo.
pt_br: Para atualizar ou excluir um artigo no OneFootball, você precisará de obter o ID da mesma.

source: Obtaining an article's post ID
es_es: Cómo obtener la ID de publicación de un artículo
pt_br: Obtendo um ID de um artigo

source: To get the OneFootball post ID for an article so that you can reference it in update or delete operations, take the example below and do the following:
es_es: Para obtener el ID de publicación de OneFootball para un artículo a fin de poder consultarlo en las operaciones de actualización o eliminación, siga el ejemplo que está abajo y haga lo siguiente:
pt_br: Para obter o ID de um artigo no OneFootball siga o exemplo abaixo e faça o seguinte:

source: Replace ``EXTERNAL_ID`` in the URL with the id of the article in your system that you provided when publishing the article. This should be encoded if necessary.
es_es: Reemplace ``EXTERNAL_ID`` en la URL con la id del artículo en su sistema, la cual usted proporcionó al publicar el artículo. Esto debe ser codificado de ser necesario.
pt_br: Substitua o EXTERNAL_ID pelo ID do artigo no seu sistema, que você forneceu ao publicar a notícia. Isto deve ser codificado se necessário.

source: Updating an article
es_es: Actualizar un artículo
pt_br: Atualizando um artigo

source: Occasionally, you may edit an article from your site. To ensure that this article is updated on OneFootball, use the ``PUT`` method of the post entity endpoint.
es_es: Ocasionalmente, puede editar un artículo de su sitio. Para asegurarse de que este artículo se actualice en OneFootball, use el método ``PUT`` del punto final de la entidad de la publicación.
pt_br: Em certas ocasiões, você poderá editar um artigo. Para garantir que ele seja atualizado no OneFootball, use o método ``PUT``.

source: Replace ``POST_ID`` in the URL with the OneFootball post ID of the article you want to update (see above for how to obtain this).
es_es: Reemplace ``POST_ID`` en la URL con el ID de publicación de OneFootball del artículo que desea actualizar (consulte más arriba cómo obtenerla).
pt_br: Substitua ``POST_ID`` no URL pelo ID do artigo que você deseja atualizar (veja acima como obtê-lo).

source: Set all article attributes as shown in the example below. Note that all attributes will overwrite existing values.
es_es: Establezca todos los atributos del artículo como se muestra en el siguiente ejemplo. Tenga en cuenta que todos los atributos sobrescribirán los valores existentes.
pt_br: Defina todos os atributos do artigo como mostrado no exemplo abaixo. Observe que todos os atributos substituirão os valores existentes.

source: Deleting an article
es_es: Borrar un artículo
pt_br: Excluindo um artigo

source: You can also delete articles from OneFootball using the ``DELETE`` method of the posts endpoint.
es_es: También puede eliminar artículos de OneFootball utilizando el método ``DELETE`` del punto final de la publicación.
pt_br: Você também pode excluir artigos do OneFootball usando o método ``DELETE``.

source: Replace ``POST_ID`` in the URL with the OneFootball post ID of the article you want to delete (see above for how to obtain this)
es_es: Reemplace ``POST_ID`` en la URL con el ID de publicación de OneFootball del artículo que desea eliminar (consulte más arriba cómo obtenerla).
pt_br: Substitua ``POST_ID`` pelo ID do artigo que você deseja apagar (veja acima como obtê-lo).
